code-review/NRB_3471_3546/База_Стало/Reports/РегуляторнаяОтчетность_Форма_0409718_1_0.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>РегуляторнаяОтчетность_Форма_0409718_1_0</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеОтчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦБ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Эмитент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОрганизацияЮрЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИностраннаяОрганизацияЮрЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеЭм</Name>
							<Comment>2</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакЭм</Name>
							<Comment>3</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакКодаЭмНерез</Name>
							<Comment>4</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИНН_Эм</Name>
							<Comment>5</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TIN_Эм</Name>
							<Comment>6</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОГРН_Эм</Name>
							<Comment>7</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>13</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтрЭм</Name>
							<Comment>8</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТипаЦБ</Name>
							<Comment>9</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомРегЦБ</Name>
							<Comment>10</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ISIN</Name>
							<Comment>11</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CFI</Name>
							<Comment>12</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>6</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодВал</Name>
							<Comment>13</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомСтоимЦБ</Name>
							<Comment>14</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>32</v8:Digits>
									<v8:FractionDigits>20</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСчета</Name>
							<Comment>15</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолЗЦБ</Name>
							<Comment>16</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>32</v8:Digits>
									<v8:FractionDigits>20</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЗЦБОгрРаспрВсего</Name>
							<Comment>17</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>32</v8:Digits>
									<v8:FractionDigits>20</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЗЦБОгрРаспрЗалог</Name>
							<Comment>18</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>32</v8:Digits>
									<v8:FractionDigits>20</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЗЦБОгрРаспрСчДепо</Name>
							<Comment>19</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>32</v8:Digits>
									<v8:FractionDigits>20</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЗЦБОгрРаспрКорпДейств</Name>
							<Comment>20</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>32</v8:Digits>
									<v8:FractionDigits>20</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЗЦБОгрРаспрЗапрОп</Name>
							<Comment>21</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>32</v8:Digits>
									<v8:FractionDigits>20</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЗЦБОгрРаспрЭскроу</Name>
							<Comment>22</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>32</v8:Digits>
									<v8:FractionDigits>20</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЗЦБОгрРаспрАрест</Name>
							<Comment>23</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>32</v8:Digits>
									<v8:FractionDigits>20</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСекторЭк</Name>
							<Comment>24</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтрВладельца</Name>
							<Comment>25</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакВладельцаСчета</Name>
							<Comment>26</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаимИнОрг</Name>
							<Comment>27</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакИнОрг</Name>
							<Comment>28</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакКодаИнОргНерез</Name>
							<Comment>29</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИНН_ИнОрг</Name>
							<Comment>30</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TIN_ИнОрг</Name>
							<Comment>31</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтрИнОрг</Name>
							<Comment>32</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтрКА</Name>
							<Comment>33</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗВыплат</Name>
							<Comment>34</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодВалЗВыплат</Name>
							<Comment>35</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолКлиентов</Name>
							<Comment>36</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаимОрг</Name>
							<Comment>37</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакОрг</Name>
							<Comment>38</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакКодаОргНерез</Name>
							<Comment>39</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИНН_Орг</Name>
							<Comment>40</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TIN_Орг</Name>
							<Comment>41</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОГРН_Орг</Name>
							<Comment>42</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>13</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Comment>43</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/ПризнакиСчетаДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПризнакиСчетаДепо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СчетКонтрагента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетДепонента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Reports/РегуляторнаяОтчетность_Форма_0409718_1_0/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура заполняет данными ТЧ ДанныеОтчета
// BSLLS:MethodSize-off
Процедура ПолучитьДанные() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	// Важно, что реквизит Резидент в справочнике контрагентов, как это ни парадоксально, означает "Нерезидент по документам"
	// - живите теперь с этим, если не знали раньше
	// Условия типа 1 = 1 в нескольких местах запроса в виртуальных таблицах среза последних - это чтобы Sonar не ругался
	// на виртуальную таблицу без параметров
	"ВЫБРАТЬ
	|	ЦенныеБумагиМестаХранения.Ссылка КАК ЦБ,
	|	&ЮрЛицоЕвроклир КАК ИностранныйДепозитарий
	|ПОМЕСТИТЬ ВТ_ЗаблокированныеЦБ
	|ИЗ
	|	Справочник.ЦенныеБумаги.МестаХранения КАК ЦенныеБумагиМестаХранения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ПО ЦенныеБумагиМестаХранения.Ссылка = ЦенныеБумаги.Ссылка
	|			И (НЕ ЦенныеБумаги.ПометкаУдаления)
	|			И (ЦенныеБумагиМестаХранения.МестоХранения = &ЮрЛицоЕвроклир)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦенныеБумагиМестаХранения.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаДепо.Ссылка КАК СчетДепо
	|ПОМЕСТИТЬ ВТ_АктивныеСчетаДепоКлиентовВключаемыхВОтчетВидов
	|ИЗ
	|	Справочник.СчетаДепо КАК СчетаДепо
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлассификаторДляОтчетовВидыСчетовДЕПО КАК ВидыСчетовДепоДляОтчетов
	|		ПО СчетаДепо.ТипСчетаДепо = ВидыСчетовДепоДляОтчетов.ТипСчета1С
	|			И (ВидыСчетовДепоДляОтчетов.ВидСчетаДляОтчета В (&ВидыСчетовДепоВключаемыеВОтчет))
	|ГДЕ
	|	НЕ СчетаДепо.ПометкаУдаления
	|	И СчетаДепо.ПризнакСчетаДепо = ЗНАЧЕНИЕ(Перечисление.ПризнакиСчетаДепо.СчетДепонента)
	|	И СчетаДепо.ВидСчетаДепо <> ЗНАЧЕНИЕ(Перечисление.ВидыСчетовДепо.ПустаяСсылка)
	|	И СчетаДепо.ДатаОткрытияСчета <= &ПериодКонец
	|	И ВЫБОР
	|			КОГДА СчетаДепо.СтатусСчетаДепо = ЗНАЧЕНИЕ(Перечисление.СтатусыСчетовДепо.Открыт)
	|					И СчетаДепо.ДатаЗакрытияСчета = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			КОГДА СчетаДепо.СтатусСчетаДепо = ЗНАЧЕНИЕ(Перечисление.СтатусыСчетовДепо.Закрыт)
	|					И СчетаДепо.ДатаЗакрытияСчета > &ПериодКонец
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Поручение.Ссылка КАК ПоручениеСсылка
	|ПОМЕСТИТЬ ВТ_ПорученияНаВыплатыПоЗаблокированнымЦБ
	|ИЗ
	|	Документ.Поручение КАК Поручение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыОпераций КАК ВидыОпераций
	|		ПО Поручение.ВидОперацииД = ВидыОпераций.Ссылка
	|			И (НЕ Поручение.ПометкаУдаления)
	|			И (Поручение.Дата <= &ПериодКонец)
	|			И (ВидыОпераций.ВыплатаДоходаВДенежнойФорме)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	|		ПО Поручение.БанковскийСчет = БанковскиеСчета.Ссылка
	|			И (БанковскиеСчета.ЦельОткрытияСчета = ЗНАЧЕНИЕ(Перечисление.ЦельОткрытияСчета0420409.СчетДляЗаблокированныхВыплат))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Поручение.ЦенныеБумагиСписываемые КАК ПоручениеЦенныеБумагиСписываемые
	|		ПО Поручение.Ссылка = ПоручениеЦенныеБумагиСписываемые.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗаблокированныеЦБ КАК ВТ_ЗаблокированныеЦБ
	|		ПО Поручение.ЦенныеБумагиСписываемые.ЦеннаяБумага = ВТ_ЗаблокированныеЦБ.ЦБ
	|
	|СГРУППИРОВАТЬ ПО
	|	Поручение.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыПорученийСрезПоследних.Поручение КАК ПоручениеСсылка
	|ПОМЕСТИТЬ ВТ_ИсполненныеПорученияНаВыплатыПоЗаблокированнымЦБ
	|ИЗ
	|	РегистрСведений.СтатусыПоручений.СрезПоследних(
	|			&ПериодКонец,
	|			Поручение В
	|				(ВЫБРАТЬ
	|					ПорученияНаВыплаты.ПоручениеСсылка КАК ПоручениеСсылка
	|				ИЗ
	|					ВТ_ПорученияНаВыплатыПоЗаблокированнымЦБ КАК ПорученияНаВыплаты)) КАК СтатусыПорученийСрезПоследних
	|ГДЕ
	|	СтатусыПорученийСрезПоследних.СтатусПоручения = ЗНАЧЕНИЕ(Перечисление.СтатусыПоручений.Исполнено)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоручениеЦенныеБумагиСписываемые.СчетДепо КАК СчетДепо,
	|	ПоручениеЦенныеБумагиСписываемые.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ПоручениеЦенныеБумагиСписываемые.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ПоручениеЦенныеБумагиСписываемые.СчетДепоМХ КАК СчетДепоМХ,
	|	СУММА(ПоручениеЦенныеБумагиСписываемые.СуммаКВыплатеПоИПД) КАК СуммаКВыплате,
	|	Поручение.Валюта КАК ВалютаВыплаты
	|ПОМЕСТИТЬ ВТ_ЗаблокированныеВыплаты
	|ИЗ
	|	Документ.Поручение КАК Поручение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПорученияНаВыплатыПоЗаблокированнымЦБ КАК ВТ_ПорученияНаВыплаты
	|		ПО Поручение.Ссылка = ВТ_ПорученияНаВыплаты.ПоручениеСсылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсполненныеПорученияНаВыплатыПоЗаблокированнымЦБ КАК ИсполненныеПоручения
	|		ПО Поручение.Ссылка = ИсполненныеПоручения.ПоручениеСсылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Поручение.ЦенныеБумагиСписываемые КАК ПоручениеЦенныеБумагиСписываемые
	|		ПО Поручение.Ссылка = ПоручениеЦенныеБумагиСписываемые.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗаблокированныеЦБ КАК ВТ_ЗаблокированныеЦБ
	|		ПО Поручение.ЦенныеБумагиСписываемые.ЦеннаяБумага = ВТ_ЗаблокированныеЦБ.ЦБ
	|ГДЕ
	|	ИсполненныеПоручения.ПоручениеСсылка ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоручениеЦенныеБумагиСписываемые.СчетДепо,
	|	ПоручениеЦенныеБумагиСписываемые.ЦеннаяБумага,
	|	ПоручениеЦенныеБумагиСписываемые.РазделСчетаДепо,
	|	ПоручениеЦенныеБумагиСписываемые.СчетДепоМХ,
	|	Поручение.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиЦБОстатки.СчетДепо КАК СчетДепо,
	|	ОстаткиЦБОстатки.ЦБ КАК ЦБ,
	|	ОстаткиЦБОстатки.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ОстаткиЦБОстатки.СчетДепоМХ КАК СчетДепоМХ,
	|	ОстаткиЦБОстатки.СтатусЦБ КАК СтатусЦБ,
	|	ОстаткиЦБОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	0 КАК СуммаКВыплате,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаВыплаты
	|ПОМЕСТИТЬ ВТ_ОстаткиЗаблокированныхЦБ
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(
	|			&ПериодКонец,
	|			ЦБ В
	|					(ВЫБРАТЬ
	|						ВТ_ЗаблокированныеЦБ.ЦБ КАК ЦБ
	|					ИЗ
	|						ВТ_ЗаблокированныеЦБ КАК ВТ_ЗаблокированныеЦБ)
	|				И СчетДепо В
	|					(ВЫБРАТЬ
	|						ВТ_АктивныеСчетаДепоКлиентовВключаемыхВОтчетВидов.СчетДепо КАК СчетДепо
	|					ИЗ
	|						ВТ_АктивныеСчетаДепоКлиентовВключаемыхВОтчетВидов КАК ВТ_АктивныеСчетаДепоКлиентовВключаемыхВОтчетВидов)) КАК ОстаткиЦБОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ЗаблокированныеВыплаты.СчетДепо,
	|	ВТ_ЗаблокированныеВыплаты.ЦеннаяБумага,
	|	ВТ_ЗаблокированныеВыплаты.РазделСчетаДепо,
	|	ВТ_ЗаблокированныеВыплаты.СчетДепоМХ,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыЦБ.ПустаяСсылка),
	|	0,
	|	ВТ_ЗаблокированныеВыплаты.СуммаКВыплате,
	|	ВТ_ЗаблокированныеВыплаты.ВалютаВыплаты
	|ИЗ
	|	ВТ_ЗаблокированныеВыплаты КАК ВТ_ЗаблокированныеВыплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиЗаблокированныхЦБ.ЦБ КАК ЦБ
	|ПОМЕСТИТЬ ВТ_ВсеЦБсОстатками
	|ИЗ
	|	ВТ_ОстаткиЗаблокированныхЦБ КАК ВТ_ОстаткиЗаблокированныхЦБ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиЗаблокированныхЦБ.ЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеЦБсОстатками.ЦБ КАК ЦБ,
	|	ВЫБОР
	|		КОГДА ЦенныеБумаги.ТипЦБ В (&ТипыДепозитарныхРасписок)
	|			ТОГДА БазовыеАктивы.Эмитент
	|		ИНАЧЕ ЦенныеБумаги.Эмитент
	|	КОНЕЦ КАК Эмитент
	|ПОМЕСТИТЬ ВТ_ЭмитентыЦБ
	|ИЗ
	|	ВТ_ВсеЦБсОстатками КАК ВТ_ВсеЦБсОстатками
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ПО ВТ_ВсеЦБсОстатками.ЦБ = ЦенныеБумаги.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК БазовыеАктивы
	|		ПО (ЦенныеБумаги.БазовыйАктив = БазовыеАктивы.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВсеЦБсОстатками.ЦБ,
	|	ВЫБОР
	|		КОГДА ЦенныеБумаги.ТипЦБ В (&ТипыДепозитарныхРасписок)
	|			ТОГДА БазовыеАктивы.Эмитент
	|		ИНАЧЕ ЦенныеБумаги.Эмитент
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЭмитентыЦБ.Эмитент КАК Эмитент
	|ПОМЕСТИТЬ ВТ_Эмитенты
	|ИЗ
	|	ВТ_ЭмитентыЦБ КАК ВТ_ЭмитентыЦБ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЭмитентыЦБ.Эмитент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлиентыСУчетомНаСчетахТипаС.Клиент КАК Эмитент
	|ПОМЕСТИТЬ ВТ_ЭмитентыСУчетомНаСчетахТипаС
	|ИЗ
	|	РегистрСведений.КлиентыСУчетомНаСчетахТипаC.СрезПоследних(
	|			&ОтчетнаяДата,
	|			Клиент В
	|				(ВЫБРАТЬ
	|					ВТ_Эмитенты.Эмитент КАК Эмитент
	|				ИЗ
	|					ВТ_Эмитенты КАК ВТ_Эмитенты)) КАК КлиентыСУчетомНаСчетахТипаС
	|ГДЕ
	|	КлиентыСУчетомНаСчетахТипаС.ФлагАктивности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Эмитенты.Эмитент КАК Эмитент,
	|	Контрагенты.Резидент КАК Нерезидент
	|ПОМЕСТИТЬ ВТ_РезидентствоЭмитентов
	|ИЗ
	|	ВТ_Эмитенты КАК ВТ_Эмитенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВТ_Эмитенты.Эмитент = Контрагенты.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Эмитенты.Эмитент КАК Эмитент,
	|	МАКСИМУМ(КодыЗагрузки.Код) КАК LEI,
	|	КОЛИЧЕСТВО(*) КАК КоличествоLEI
	|ПОМЕСТИТЬ ВТ_ЭмитентыКодыLEI
	|ИЗ
	|	ВТ_Эмитенты КАК ВТ_Эмитенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВТ_Эмитенты.Эмитент = Контрагенты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РезидентствоЭмитентов КАК ВТ_РезидентствоЭмитентов
	|		ПО ВТ_Эмитенты.Эмитент = ВТ_РезидентствоЭмитентов.Эмитент
	|			И (ВТ_РезидентствоЭмитентов.Нерезидент)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|		ПО (Контрагенты.ЮридическиеФизическиеЛица = ЮридическиеЛица.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО (ЮридическиеЛица.Ссылка = КодыЗагрузки.Владелец)
	|			И (КодыЗагрузки.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.LEI_Code))
	|			И (НЕ КодыЗагрузки.ПометкаУдаления)
	|			И (КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузки.ДатаОкончанияДействия > &ПериодКонец)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Эмитенты.Эмитент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЮридическиеЛица.ИНН КАК ИНН
	|ПОМЕСТИТЬ ВТ_ИННЭмитентов
	|ИЗ
	|	ВТ_Эмитенты КАК ВТ_Эмитенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВТ_Эмитенты.Эмитент = Контрагенты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|		ПО (Контрагенты.ЮридическиеФизическиеЛица = ЮридическиеЛица.Ссылка)
	|			И ЮридическиеЛица.ИНН <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЮридическиеЛицаЦБРФСрезПоследних.Период КАК Период,
	|	ЮридическиеЛицаЦБРФСрезПоследних.ИНН КАК ИНН,
	|	ЮридическиеЛицаЦБРФСрезПоследних.ОГРН КАК ОГРН,
	|	ЮридическиеЛицаЦБРФСрезПоследних.Наименование КАК Наименование
	|ПОМЕСТИТЬ ВТ_ЮридическиеЛицаЭмитентовЦБРФ
	|ИЗ
	|	РегистрСведений.ЮридическиеЛицаЦБРФ.СрезПоследних(
	|			&ПериодКонец,
	|			ИНН В
	|				(ВЫБРАТЬ
	|					ВТ_ИНН.ИНН КАК ИНН
	|				ИЗ
	|					ВТ_ИННЭмитентов КАК ВТ_ИНН)) КАК ЮридическиеЛицаЦБРФСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЮридическиеЛицаМеждународныеКомпанииСрезПоследних.МеждународнаяКомпания КАК МеждународнаяКомпания,
	|	ЮридическиеЛицаМеждународныеКомпанииСрезПоследних.ЮридическоеЛицо КАК ЮридическоеЛицо
	|ПОМЕСТИТЬ ЮридическиеЛицаМеждународныеКомпании
	|ИЗ
	|	РегистрСведений.ЮридическиеЛицаМеждународныеКомпании.СрезПоследних(&ПериодКонец, 1 = 1) КАК ЮридическиеЛицаМеждународныеКомпанииСрезПоследних
	|ГДЕ
	|	ЮридическиеЛицаМеждународныеКомпанииСрезПоследних.МеждународнаяКомпания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Эмитенты.Эмитент КАК Эмитент,
	|	ВТ_РезидентствоЭмитентов.Нерезидент КАК НеРезидент,
	|	Контрагенты.ЮридическиеФизическиеЛица КАК ЮридическиеФизическиеЛица,
	|	ВЫБОР
	|		КОГДА Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|				И НЕ ВТ_РезидентствоЭмитентов.Нерезидент
	|			ТОГДА ""1""
	|		КОГДА Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|				И ВТ_РезидентствоЭмитентов.Нерезидент
	|			ТОГДА ""2""
	|	КОНЕЦ КАК ПризнакЭм,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_РезидентствоЭмитентов.Нерезидент
	|				ИЛИ ВТ_РезидентствоЭмитентов.Нерезидент
	|					И ЕСТЬNULL(ЮридическиеЛицаМеждународныеКомпании.МеждународнаяКомпания, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|					КОГДА ЮридическиеЛица.ИНН = """"
	|						ТОГДА ""0000000000""
	|					ИНАЧЕ ЕСТЬNULL(ЮридическиеЛица.ИНН, ""0000000000"")
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ИНН_Эм,
	|	ВЫБОР
	|		КОГДА Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоЮрлицо,
	|	ВЫБОР
	|		КОГДА ВТ_РезидентствоЭмитентов.Нерезидент
	|				И НЕ ЕСТЬNULL(ЮридическиеЛицаМеждународныеКомпании.МеждународнаяКомпания, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|					КОГДА Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|						ТОГДА ВЫБОР
	|								КОГДА ЮридическиеЛица.ИНН <> """"
	|									ТОГДА ""TIN""
	|								КОГДА ЮридическиеЛица.TIN <> """"
	|									ТОГДА ""TIN""
	|								КОГДА ЮридическиеЛица.РегНомер <> """"
	|									ТОГДА ""RN""
	|								КОГДА НЕ ВТ_ЭмитентыКодыLEI.LEI ЕСТЬ NULL
	|									ТОГДА ""LEI""
	|								ИНАЧЕ ""NN""
	|							КОНЕЦ
	|					КОГДА Контрагенты.TIN <> """"
	|						ТОГДА ""TIN""
	|					ИНАЧЕ ""NN""
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПризнакКодаЭмНерез,
	|	ВЫБОР
	|		КОГДА ВТ_РезидентствоЭмитентов.Нерезидент
	|				И НЕ ЕСТЬNULL(ЮридическиеЛицаМеждународныеКомпании.МеждународнаяКомпания, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|					КОГДА Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|						ТОГДА ВЫБОР
	|								КОГДА ЮридическиеЛица.ИНН <> """"
	|									ТОГДА ЮридическиеЛица.ИНН
	|								КОГДА ЮридическиеЛица.TIN <> """"
	|									ТОГДА ЮридическиеЛица.TIN
	|								КОГДА ЮридическиеЛица.РегНомер <> """"
	|									ТОГДА ЮридическиеЛица.РегНомер
	|								КОГДА НЕ ВТ_ЭмитентыКодыLEI.LEI ЕСТЬ NULL
	|									ТОГДА ВТ_ЭмитентыКодыLEI.LEI
	|								ИНАЧЕ ""000""
	|							КОНЕЦ
	|					КОГДА Контрагенты.TIN <> """"
	|						ТОГДА Контрагенты.TIN
	|					ИНАЧЕ ""000""
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК TIN_Эм,
	|	ВТ_ЭмитентыКодыLEI.КоличествоLEI КАК КоличествоLEI,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_РезидентствоЭмитентов.Нерезидент
	|				ИЛИ ВТ_РезидентствоЭмитентов.Нерезидент
	|					И ЕСТЬNULL(ЮридическиеЛицаМеждународныеКомпании.МеждународнаяКомпания, ЛОЖЬ)
	|			ТОГДА ЕСТЬNULL(ЮридическиеЛицаЦБРФ.ОГРН, ЮридическиеЛица.ОГРН)
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ОГРН_Эм,
	|	ВЫБОР
	|		КОГДА Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ЮридическиеЛицаМеждународныеКомпании.МеждународнаяКомпания, ЛОЖЬ)
	|						ТОГДА ""996""
	|					КОГДА ЮридическиеЛица.МеждународнаяОрганизация
	|						ТОГДА ""998""
	|					КОГДА НЕ ВТ_РезидентствоЭмитентов.Нерезидент
	|						ТОГДА ""643""
	|					ИНАЧЕ ЕСТЬNULL(КлассификаторСтранМира.Код, ""999"")
	|				КОНЕЦ
	|		ИНАЧЕ ""999""
	|	КОНЕЦ КАК КодСтрЭм,
	|	ВЫБОР
	|		КОГДА ВТ_ЭмитентыСУчетомНаСчетахТипаС.Эмитент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТипС,
	|	ЮридическиеЛицаЦБРФ.ИНН ЕСТЬ NULL КАК НетСоответствияИННДляЦБРФ,
	|	ВЫБОР
	|		// Обычный резидент
	|		КОГДА НЕ ВТ_РезидентствоЭмитентов.Нерезидент
	|			ТОГДА ЕСТЬNULL(ЮридическиеЛицаЦБРФ.Наименование, ЕСТЬNULL(ВЫРАЗИТЬ(ЮридическиеЛица.ПолноеНаименование КАК СТРОКА(255)), """"))
	|		// Международная компания
	|		КОГДА ВТ_РезидентствоЭмитентов.Нерезидент
	|					И ЕСТЬNULL(ЮридическиеЛицаМеждународныеКомпании.МеждународнаяКомпания, ЛОЖЬ)
	|			ТОГДА ЕСТЬNULL(ЮридическиеЛицаЦБРФ.Наименование, Контрагенты.Наименование)
	|		// Нерезидент
	|		ИНАЧЕ ЕСТЬNULL(ЮридическиеЛицаЦБРФ.Наименование, ЕСТЬNULL(ВЫРАЗИТЬ(ЮридическиеЛица.ПолноеНаименованиеНаАнглийскомЯзыке КАК СТРОКА(255)), """"))
	|	КОНЕЦ КАК НаименованиеЭмитента,
	|	НЕ ВТ_РезидентствоЭмитентов.Нерезидент
	|		ИЛИ ВТ_РезидентствоЭмитентов.Нерезидент
	|			И ЕСТЬNULL(ЮридическиеЛицаМеждународныеКомпании.МеждународнаяКомпания, ЛОЖЬ) КАК ЭтоРезидентИлиНерезидентМК
	|ПОМЕСТИТЬ ВТ_ДанныеПоЭмитентам
	|ИЗ
	|	ВТ_Эмитенты КАК ВТ_Эмитенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВТ_Эмитенты.Эмитент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РезидентствоЭмитентов КАК ВТ_РезидентствоЭмитентов
	|		ПО ВТ_Эмитенты.Эмитент = ВТ_РезидентствоЭмитентов.Эмитент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|			ЛЕВОЕ СОЕДИНЕНИЕ ЮридическиеЛицаМеждународныеКомпании КАК ЮридическиеЛицаМеждународныеКомпании
	|			ПО ЮридическиеЛица.Ссылка = ЮридическиеЛицаМеждународныеКомпании.ЮридическоеЛицо
	|		ПО (Контрагенты.ЮридическиеФизическиеЛица = ЮридическиеЛица.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО (Контрагенты.РегионДляОтчетов = КлассификаторСтранМира.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЭмитентыСУчетомНаСчетахТипаС КАК ВТ_ЭмитентыСУчетомНаСчетахТипаС
	|		ПО (ВТ_ЭмитентыСУчетомНаСчетахТипаС.Эмитент = ВТ_Эмитенты.Эмитент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЭмитентыКодыLEI КАК ВТ_ЭмитентыКодыLEI
	|		ПО ВТ_Эмитенты.Эмитент = ВТ_ЭмитентыКодыLEI.Эмитент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЮридическиеЛицаЭмитентовЦБРФ КАК ЮридическиеЛицаЦБРФ
	|		ПО (ЮридическиеЛицаЦБРФ.ИНН = ЮридическиеЛица.ИНН)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЭмитентыЦБ.ЦБ КАК ЦБ,
	|	ВТ_ЭмитентыЦБ.Эмитент КАК Эмитент,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ЦенныеБумаги.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Пай)
	|				ТОГДА ВТ_ДанныеПоЭмитентам.НаименованиеЭмитента + "" ("" + ЦенныеБумаги.Наименование + "")""
	|			КОГДА ЦенныеБумаги.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.КлиринговыйСертификатУчастия)
	|				ТОГДА ВТ_ДанныеПоЭмитентам.НаименованиеЭмитента + "" ("" + ЦенныеБумаги.Наименование + "")""
	|			ИНАЧЕ ВТ_ДанныеПоЭмитентам.НаименованиеЭмитента
	|		КОНЕЦ КАК СТРОКА(150)) КАК НаименованиеЭм
	|ПОМЕСТИТЬ ВТ_НаименованияЭмитентовЦБ
	|ИЗ
	|	ВТ_ЭмитентыЦБ КАК ВТ_ЭмитентыЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоЭмитентам КАК ВТ_ДанныеПоЭмитентам
	|		ПО ВТ_ЭмитентыЦБ.Эмитент = ВТ_ДанныеПоЭмитентам.Эмитент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ПО ВТ_ЭмитентыЦБ.ЦБ = ЦенныеБумаги.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоминалЦБСрезПоследних.ЦеннаяБумага КАК ЦБ,
	|	НоминалЦБСрезПоследних.Сумма КАК Номинал
	|ПОМЕСТИТЬ ВТ_НоминалЦБ
	|ИЗ
	|	РегистрСведений.НоминалЦБ.СрезПоследних(
	|			&ПериодКонец,
	|			ЦеннаяБумага В
	|				(ВЫБРАТЬ
	|					ВТ_ВсеЦБсОстатками.ЦБ КАК ЦБ
	|				ИЗ
	|					ВТ_ВсеЦБсОстатками КАК ВТ_ВсеЦБсОстатками)) КАК НоминалЦБСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеЦБсОстатками.ЦБ КАК ЦБ,
	|	СправочникЦенныеБумаги.ТипЦБ КАК ТипЦБ,
	|	ВидыЦББанкаРоссии.Код КАК КодТипаЦБ,
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеПоЭмитентам.ЭтоРезидентИлиНерезидентМК
	|				ИЛИ СправочникЦенныеБумаги.ISIN = """"
	|			ТОГДА СправочникЦенныеБумаги.НомерРегистрации
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомРегЦБ,
	|	СправочникЦенныеБумаги.НомерРегистрации КАК НомерРегистрации,
	|	СправочникЦенныеБумаги.ISIN КАК ISIN,
	|	СправочникЦенныеБумаги.CFI КАК CFI,
	|	СправочникЦенныеБумаги.ВалютаНоминала КАК ВалютаНоминала,
	|	ВЫБОР
	|		КОГДА СправочникЦенныеБумаги.ТипЦБ В (&ТипыЦББезНоминала)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЦББезНоминала,
	|	ЕСТЬNULL(ВТ_НоминалЦБ.Номинал, 0) КАК НомСтоимЦБ,
	|	ВидыЦББанкаРоссии.Код В (""BON5"", ""BON6"", ""BON61"", ""BON7"", ""BON71"", ""SN3"", ""SN4"")
	|		И СправочникЦенныеБумаги.ДатаПогашения <> ДАТАВРЕМЯ(1, 1, 1)
	|		И СправочникЦенныеБумаги.ДатаПогашения <= &ОтчетнаяДата
	|		И ГО.Ссылка ЕСТЬ NULL КАК ВыводитьНулевойНоминал
	|ПОМЕСТИТЬ ВТ_ПредварительныеДанныеПоЦБ
	|ИЗ
	|	ВТ_ВсеЦБсОстатками КАК ВТ_ВсеЦБсОстатками
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК СправочникЦенныеБумаги
	|		ПО ВТ_ВсеЦБсОстатками.ЦБ = СправочникЦенныеБумаги.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦББанкаРоссии КАК ВидыЦББанкаРоссии
	|		ПО (СправочникЦенныеБумаги.ВидЦББанкаРоссии = ВидыЦББанкаРоссии.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЭмитентыЦБ КАК ВТ_ЭмитентыЦБ
	|		ПО ВТ_ВсеЦБсОстатками.ЦБ = ВТ_ЭмитентыЦБ.ЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоЭмитентам КАК ВТ_ДанныеПоЭмитентам
	|		ПО (ВТ_ДанныеПоЭмитентам.Эмитент = ВТ_ЭмитентыЦБ.Эмитент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НоминалЦБ КАК ВТ_НоминалЦБ
	|		ПО ВТ_ВсеЦБсОстатками.ЦБ = ВТ_НоминалЦБ.ЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ГлобальнаяОперация КАК ГО
	|		ПО ВТ_ВсеЦБсОстатками.ЦБ = ГО.ЦеннаяБумага
	|			И (ГО.ВидГлобальнойОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Погашение))
	|			И (ГО.Дата МЕЖДУ &ПериодНачало И &ПериодКонец)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПредварительныеДанныеПоЦБ.ЦБ КАК ЦБ,
	|	ВТ_ПредварительныеДанныеПоЦБ.ТипЦБ КАК ТипЦБ,
	|	ВТ_ПредварительныеДанныеПоЦБ.КодТипаЦБ КАК КодТипаЦБ,
	|	ВТ_ПредварительныеДанныеПоЦБ.НомРегЦБ КАК НомРегЦБ,
	|	ВТ_ПредварительныеДанныеПоЦБ.НомерРегистрации КАК НомерРегистрации,
	|	ВТ_ПредварительныеДанныеПоЦБ.ISIN КАК ISIN,
	|	ВТ_ПредварительныеДанныеПоЦБ.CFI КАК CFI,
	|	ВТ_ПредварительныеДанныеПоЦБ.ВалютаНоминала КАК ВалютаНоминала,
	|	ВТ_ПредварительныеДанныеПоЦБ.ЦББезНоминала КАК ЦББезНоминала,
	|	ВЫБОР
	|		КОГДА ВТ_ПредварительныеДанныеПоЦБ.ЦББезНоминала
	|				ИЛИ ВТ_ПредварительныеДанныеПоЦБ.НомСтоимЦБ = 0
	|					И НЕ ВТ_ПредварительныеДанныеПоЦБ.ВыводитьНулевойНоминал
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(Валюты.Код, """")
	|	КОНЕЦ КАК КодВалютыНоминала,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ВТ_ПредварительныеДанныеПоЦБ.ЦББезНоминала
	|						ИЛИ ВТ_ПредварительныеДанныеПоЦБ.НомСтоимЦБ = 0
	|							И НЕ ВТ_ПредварительныеДанныеПоЦБ.ВыводитьНулевойНоминал
	|					ТОГДА """"
	|				ИНАЧЕ ЕСТЬNULL(Валюты.Код, """")
	|			КОНЕЦ = """"
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_ПредварительныеДанныеПоЦБ.НомСтоимЦБ
	|	КОНЕЦ КАК НомСтоимЦБ
	|ПОМЕСТИТЬ ВТ_ДанныеПоЦБ
	|ИЗ
	|	ВТ_ПредварительныеДанныеПоЦБ КАК ВТ_ПредварительныеДанныеПоЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО ВТ_ПредварительныеДанныеПоЦБ.ВалютаНоминала = Валюты.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиЗаблокированныхЦБ.СчетДепо КАК СчетДепо
	|ПОМЕСТИТЬ ВТ_СчетаДепо
	|ИЗ
	|	ВТ_ОстаткиЗаблокированныхЦБ КАК ВТ_ОстаткиЗаблокированныхЦБ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиЗаблокированныхЦБ.СчетДепо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СчетаДепо.СчетДепо КАК СчетДепо,
	|	ВидыСчетовДепоДляОтчетов.ВидСчетаДляОтчета КАК ВидСчетаДляОтчета,
	|	ВЫБОР
	|		КОГДА ТипыДепонентов.Код ЕСТЬ NULL
	|			ТОГДА """"
	|		КОГДА ВидыСчетовДепоДляОтчетов.ВидСчетаДляОтчета В (&ВидыСчетовСектораЭк)
	|			ТОГДА ТипыДепонентов.Код
	|		ИНАЧЕ ""000""
	|	КОНЕЦ КАК КодСекторЭк,
	|	ВЫБОР
	|		КОГДА НЕ Контрагенты.Резидент
	|			ТОГДА ""643""
	|		КОГДА Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|				И ЕСТЬNULL(ЮридическиеЛицаМеждународныеКомпании.МеждународнаяКомпания, ЛОЖЬ)
	|			ТОГДА ""996""
	|		КОГДА Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|				И ЮридическиеЛица.МеждународнаяОрганизация
	|			ТОГДА ""998""
	|		ИНАЧЕ ЕСТЬNULL(КлассификаторСтранМира.Код, ""999"")
	|	КОНЕЦ КАК КодСтрВладельца,
	|	ВЫБОР
	|		КОГДА Контрагенты.ВключенВСанкционныйСписок
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПризнакВладельцаСчета
	|ПОМЕСТИТЬ ВТ_ДанныеПоСчетамДепо
	|ИЗ
	|	ВТ_СчетаДепо КАК ВТ_СчетаДепо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДепо КАК СчетаДепо
	|		ПО ВТ_СчетаДепо.СчетДепо = СчетаДепо.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлассификаторДляОтчетовВидыСчетовДЕПО КАК ВидыСчетовДепоДляОтчетов
	|		ПО (СчетаДепо.ТипСчетаДепо = ВидыСчетовДепоДляОтчетов.ТипСчета1С)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (СчетаДепо.Владелец = Контрагенты.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|			ЛЕВОЕ СОЕДИНЕНИЕ ЮридическиеЛицаМеждународныеКомпании КАК ЮридическиеЛицаМеждународныеКомпании
	|			ПО ЮридическиеЛица.Ссылка = ЮридическиеЛицаМеждународныеКомпании.ЮридическоеЛицо
	|		ПО (Контрагенты.ЮридическиеФизическиеЛица = ЮридическиеЛица.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО (Контрагенты.ЮридическиеФизическиеЛица = ФизическиеЛица.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыДепонентов КАК ТипыДепонентов
	|		ПО (ВЫБОР
	|				КОГДА ЮридическиеЛица.ТипДепонента = ТипыДепонентов.Ссылка
	|					ТОГДА ИСТИНА
	|				КОГДА ФизическиеЛица.ТипДепонента = ТипыДепонентов.Ссылка
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО (Контрагенты.РегионДляОтчетов = КлассификаторСтранМира.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.ЦБ КАК ЦБ,
	|	ВТ_ДанныеПоСчетамДепо.ВидСчетаДляОтчета КАК ВидСчетаДляОтчета,
	|	ВТ_ДанныеПоСчетамДепо.КодСекторЭк КАК КодСекторЭк,
	|	ВТ_ДанныеПоСчетамДепо.КодСтрВладельца КАК КодСтрВладельца,
	|	ВТ_ДанныеПоСчетамДепо.ПризнакВладельцаСчета КАК ПризнакВладельцаСчета,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СчетаДепо.Владелец) КАК КолКлиентов,
	|	ВТ_ЗаблокированныеЦБ.ИностранныйДепозитарий КАК ИностраннаяОрганизация,
	|	МестаХранения.ЮридическоеЛицо КАК Организация,
	|	СУММА(Остатки.КоличествоОстаток) КАК КолЗЦБ,
	|	СУММА(ВЫБОР
	|			КОГДА РазделыСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.Торговый)
	|					ИЛИ РазделыСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.Обеспечения)
	|					ИЛИ РазделыСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.БлокированоКД)
	|					ИЛИ РазделыСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.БлокированоПоАресту)
	|					ИЛИ РазделыСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.БлокированоЗапретОпераций)
	|					ИЛИ РазделыСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.БлокированоВЗалоге)
	|					ИЛИ РазделыСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.БлокированоРасчеты)
	|					ИЛИ РазделыСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.БлокированоОбособленный)
	|					ИЛИ РазделыСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.БлокированоОбособленныйПоПредписаниямБР)
	|					ИЛИ РазделыСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.БлокированоИное)
	|					ИЛИ Остатки.СтатусЦБ = ЗНАЧЕНИЕ(Перечисление.СтатусыЦБ.Блокирована)
	|					ИЛИ НЕ ВТ_ЭмитентыСУчетомНаСчетахТипаС.Эмитент ЕСТЬ NULL
	|				ТОГДА Остатки.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КЗЦБОгрРаспрВсего,
	|	СУММА(ВЫБОР
	|			КОГДА РазделыСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.БлокированоВЗалоге)
	|				ТОГДА Остатки.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КЗЦБОгрРаспрЗалог,
	|	СУММА(ВЫБОР
	|			КОГДА СчетаДепо.ТипСчетаДепо = ЗНАЧЕНИЕ(Перечисление.ТипыСчетовДепо.ДоверительногоУправляющего)
	|					ИЛИ СчетаДепо.ТипСчетаДепо = ЗНАЧЕНИЕ(Перечисление.ТипыСчетовДепо.ВладельцаТорговый)
	|					ИЛИ СчетаДепо.ТипСчетаДепо = ЗНАЧЕНИЕ(Перечисление.ТипыСчетовДепо.ИностранногоУполномоченногоДержателяТорговый)
	|				ТОГДА Остатки.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КЗЦБОгрРаспрСчДепо,
	|	СУММА(ВЫБОР
	|			КОГДА РазделыСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.БлокированоКД)
	|				ТОГДА Остатки.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КЗЦБОгрРаспрКорпДейств,
	|	СУММА(ВЫБОР
	|			КОГДА РазделыСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.БлокированоЗапретОпераций)
	|				ТОГДА Остатки.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КЗЦБОгрРаспрЗапрОп,
	|	0 КАК КЗЦБОгрРаспрЭскроу,
	|	СУММА(ВЫБОР
	|			КОГДА РазделыСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.БлокированоПоАресту)
	|				ТОГДА Остатки.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КЗЦБОгрРаспрАрест,
	|	СУММА(Остатки.СуммаКВыплате) КАК СуммаЗВыплат,
	|	МАКСИМУМ(Остатки.ВалютаВыплаты) КАК МаксВалютаВыплаты,		// Предполагаем, что по одной бумаге заблокированные выплаты - в одной валюте
	|	МИНИМУМ(Остатки.ВалютаВыплаты) КАК МинВалютаВыплаты			// Но этот факт лучше проверить
	|ПОМЕСТИТЬ ВТ_Заблокировано
	|ИЗ
	|	ВТ_ОстаткиЗаблокированныхЦБ КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РазделыСчетаДепо КАК РазделыСчетаДепо
	|		ПО Остатки.РазделСчетаДепо = РазделыСчетаДепо.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоСчетамДепо КАК ВТ_ДанныеПоСчетамДепо
	|		ПО Остатки.СчетДепо = ВТ_ДанныеПоСчетамДепо.СчетДепо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДепо КАК СчетаДепо
	|		ПО Остатки.СчетДепо = СчетаДепо.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаблокированныеЦБ КАК ВТ_ЗаблокированныеЦБ
	|		ПО Остатки.ЦБ = ВТ_ЗаблокированныеЦБ.ЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДепоМХ КАК СчетаДепоМХ
	|		ПО Остатки.СчетДепоМХ = СчетаДепоМХ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МестаХранения КАК МестаХранения
	|		ПО (СчетаДепоМХ.Владелец = МестаХранения.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЭмитентыЦБ КАК ВТ_ЭмитентыЦБ
	|		ПО Остатки.ЦБ = ВТ_ЭмитентыЦБ.ЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЭмитентыСУчетомНаСчетахТипаС КАК ВТ_ЭмитентыСУчетомНаСчетахТипаС
	|		ПО (ВТ_ЭмитентыЦБ.Эмитент = ВТ_ЭмитентыСУчетомНаСчетахТипаС.Эмитент)
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.ЦБ,
	|	ВТ_ДанныеПоСчетамДепо.ВидСчетаДляОтчета,
	|	ВТ_ДанныеПоСчетамДепо.КодСекторЭк,
	|	ВТ_ДанныеПоСчетамДепо.КодСтрВладельца,
	|	ВТ_ДанныеПоСчетамДепо.ПризнакВладельцаСчета,
	|	ВТ_ЗаблокированныеЦБ.ИностранныйДепозитарий,
	|	МестаХранения.ЮридическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеОрганизации.ЮрЛицо КАК ЮрЛицо
	|ПОМЕСТИТЬ ВТ_ВсеОрганизации
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Заблокировано.Организация КАК ЮрЛицо
	|	ИЗ
	|		ВТ_Заблокировано КАК ВТ_Заблокировано
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Заблокировано.ИностраннаяОрганизация
	|	ИЗ
	|		ВТ_Заблокировано КАК ВТ_Заблокировано) КАК ВсеОрганизации
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеОрганизации.ЮрЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеОрганизации.ЮрЛицо КАК ЮрЛицо,
	|	МАКСИМУМ(КодыЗагрузки.Код) КАК LEI,
	|	КОЛИЧЕСТВО(*) КАК КоличествоLEI
	|ПОМЕСТИТЬ ВТ_ОрганизацииКодыLEI
	|ИЗ
	|	ВТ_ВсеОрганизации КАК ВТ_ВсеОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО ВТ_ВсеОрганизации.ЮрЛицо = КодыЗагрузки.Владелец
	|			И (КодыЗагрузки.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.LEI_Code))
	|			И (НЕ КодыЗагрузки.ПометкаУдаления)
	|			И (КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузки.ДатаОкончанияДействия > &ПериодКонец)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВсеОрганизации.ЮрЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЮридическиеЛица.ИНН КАК ИНН
	|ПОМЕСТИТЬ ВТ_ИННОрганизаций
	|ИЗ
	|	ВТ_ВсеОрганизации КАК ВТ_ВсеОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|		ПО ВТ_ВсеОрганизации.ЮрЛицо = ЮридическиеЛица.Ссылка
	|			И ЮридическиеЛица.ИНН <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЮридическиеЛицаЦБРФСрезПоследних.Период КАК Период,
	|	ЮридическиеЛицаЦБРФСрезПоследних.ИНН КАК ИНН,
	|	ЮридическиеЛицаЦБРФСрезПоследних.ОГРН КАК ОГРН,
	|	ЮридическиеЛицаЦБРФСрезПоследних.Наименование КАК Наименование
	|ПОМЕСТИТЬ ВТ_ЮридическиеЛицаОрганизацийЦБРФ
	|ИЗ
	|	РегистрСведений.ЮридическиеЛицаЦБРФ.СрезПоследних(
	|			&ПериодКонец,
	|			ИНН В
	|				(ВЫБРАТЬ
	|					ВТ_ИНН.ИНН КАК ИНН
	|				ИЗ
	|					ВТ_ИННОрганизаций КАК ВТ_ИНН)) КАК ЮридическиеЛицаЦБРФСрезПоследних
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеОрганизации.ЮрЛицо КАК ЮрЛицо,
	|	ЮридическиеЛица.ПолноеНаименование КАК Наименование,
	|	ВЫБОР
	|		КОГДА ЮридическиеЛица.НеРезидент
	|			ТОГДА ""2""
	|		ИНАЧЕ ""1""
	|	КОНЕЦ КАК ПризнакНерез,
	|	ВЫБОР
	|		КОГДА ЮридическиеЛица.НеРезидент
	|			ТОГДА ВЫБОР
	|					КОГДА ЮридическиеЛица.TIN <> """"
	|						ТОГДА ""TIN""
	|					КОГДА ЮридическиеЛица.РегНомер <> """"
	|						ТОГДА ""RN""
	|					КОГДА НЕ ВТ_ОрганизацииКодыLEI.LEI ЕСТЬ NULL
	|						ТОГДА ""LEI""
	|					ИНАЧЕ ""NN""
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПризнакКода,
	|	ВЫБОР
	|		КОГДА ЮридическиеЛица.НеРезидент
	|			ТОГДА ВЫБОР
	|					КОГДА ЮридическиеЛица.TIN <> """"
	|						ТОГДА ЮридическиеЛица.TIN
	|					КОГДА ЮридическиеЛица.РегНомер <> """"
	|						ТОГДА ЮридическиеЛица.РегНомер
	|					КОГДА НЕ ВТ_ОрганизацииКодыLEI.LEI ЕСТЬ NULL
	|						ТОГДА ВТ_ОрганизацииКодыLEI.LEI
	|					ИНАЧЕ ""000""
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодTIN,
	|	ВЫБОР
	|		КОГДА ЮридическиеЛица.НеРезидент
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЮридическиеЛица.ИНН = """"
	|					ТОГДА ""0000000000""
	|				ИНАЧЕ ЕСТЬNULL(ЮридическиеЛица.ИНН, ""0000000000"")
	|			КОНЕЦ
	|	КОНЕЦ КАК РезидентИНН,
	|	ЕСТЬNULL(КлассификаторСтранМира.Код, ""999"") КАК КодСтраны,
	|	ЕСТЬNULL(ЮридическиеЛицаЦБРФ.ОГРН, ЮридическиеЛица.ОГРН) КАК ОГРН
	|ПОМЕСТИТЬ ВТ_ДанныеПоОрганизациям
	|ИЗ
	|	ВТ_ВсеОрганизации КАК ВТ_ВсеОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|		ПО ВТ_ВсеОрганизации.ЮрЛицо = ЮридическиеЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОрганизацииКодыLEI КАК ВТ_ОрганизацииКодыLEI
	|		ПО ВТ_ВсеОрганизации.ЮрЛицо = ВТ_ОрганизацииКодыLEI.ЮрЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЮридическиеЛицаОрганизацийЦБРФ КАК ЮридическиеЛицаЦБРФ
	|		ПО (ЮридическиеЛицаЦБРФ.ИНН = ЮридическиеЛица.ИНН)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО (ЮридическиеЛица.Страна = КлассификаторСтранМира.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заблокировано.ЦБ КАК ЦБ,
	|	ВТ_Заблокировано.Организация КАК Организация,
	|	ВТ_Заблокировано.МаксВалютаВыплаты КАК МаксВалютаВыплаты,
	|	ВТ_Заблокировано.МинВалютаВыплаты КАК МинВалютаВыплаты
	|ИЗ
	|	ВТ_Заблокировано КАК ВТ_Заблокировано
	|ГДЕ
	|	ВТ_Заблокировано.СуммаЗВыплат <> 0
	|	И ВТ_Заблокировано.МаксВалютаВыплаты <> ВТ_Заблокировано.МинВалютаВыплаты
	|	И ВТ_Заблокировано.МинВалютаВыплаты <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МестаХранения.Ссылка КАК МестоХранения,
	|	МестаХранения.ЮридическоеЛицо КАК ЮрЛицо
	|ИЗ
	|	ВТ_ОстаткиЗаблокированныхЦБ КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДепоМХ КАК СчетаДепоМХ
	|		ПО Остатки.СчетДепоМХ = СчетаДепоМХ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МестаХранения КАК МестаХранения
	|		ПО (СчетаДепоМХ.Владелец = МестаХранения.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	МестаХранения.Ссылка,
	|	МестаХранения.ЮридическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПоОрганизациям.ЮрЛицо КАК ЮрЛицо,
	|	ВТ_ДанныеПоОрганизациям.Наименование КАК Наименование,
	|	ВТ_ДанныеПоОрганизациям.РезидентИНН КАК РезидентИНН
	|ИЗ
	|	ВТ_ДанныеПоОрганизациям КАК ВТ_ДанныеПоОрганизациям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПоЦБ.ЦБ КАК ЦБ,
	|	ВТ_ДанныеПоЦБ.ISIN КАК ISIN,
	|	ВТ_ДанныеПоЦБ.ЦББезНоминала КАК ЦББезНоминала,
	|	ВТ_ДанныеПоЦБ.НомСтоимЦБ КАК НомСтоимЦБ,
	|	ВТ_ДанныеПоЦБ.ВалютаНоминала КАК ВалютаНоминала
	|ИЗ
	|	ВТ_ДанныеПоЦБ КАК ВТ_ДанныеПоЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПоЭмитентам.Эмитент КАК Эмитент,
	|	ВТ_ДанныеПоЭмитентам.ИНН_Эм КАК ИНН_Эм,
	|	ВТ_ДанныеПоЭмитентам.ОГРН_Эм КАК ОГРН_Эм,
	|	ВТ_ДанныеПоЭмитентам.КодСтрЭм КАК КодСтрЭм,
	|	ВТ_ДанныеПоЭмитентам.КоличествоLEI КАК КоличествоLEI,
	|	ВТ_ДанныеПоЭмитентам.НетСоответствияИННДляЦБРФ КАК НетСоответствияИННДляЦБРФ,
	|	ВТ_ДанныеПоЭмитентам.ЮридическиеФизическиеЛица КАК ЮридическиеФизическиеЛица,
	|	ВТ_ДанныеПоЭмитентам.ПризнакКодаЭмНерез КАК ПризнакКодаЭмНерез,
	|	ВТ_ДанныеПоЭмитентам.ЭтоРезидентИлиНерезидентМК КАК ЭтоРезидентИлиНерезидентМК
	|ИЗ
	|	ВТ_ДанныеПоЭмитентам КАК ВТ_ДанныеПоЭмитентам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заблокировано.ЦБ КАК ЦБ,
	|	ВТ_ДанныеПоЭмитентам.Эмитент КАК Эмитент,
	|	ВТ_Заблокировано.ИностраннаяОрганизация КАК ИностраннаяОрганизацияЮрЛицо,
	|	ВТ_Заблокировано.Организация КАК ОрганизацияЮрЛицо,
	|	ВТ_НаименованияЭмитентовЦБ.НаименованиеЭм КАК НаименованиеЭм,		//  2  Наименование эмитента
	|	ВТ_ДанныеПоЭмитентам.ПризнакЭм КАК ПризнакЭм,						//  3  Признак эмитента: резидент/нерезидент
	|	ВТ_ДанныеПоЭмитентам.ПризнакКодаЭмНерез КАК ПризнакКодаЭмНерез,		//  4  Признак кода эмитента нерезидента
	|	ВТ_ДанныеПоЭмитентам.ИНН_Эм КАК ИНН_Эм,								//  5  ИНН эмитента
	|	ВТ_ДанныеПоЭмитентам.TIN_Эм КАК TIN_Эм,								//  6  TIN или LEI или регистрационный номер в стране регистрации
	|	ВТ_ДанныеПоЭмитентам.ОГРН_Эм КАК ОГРН_Эм,							//  7  ОГРН эмитента
	|	ВТ_ДанныеПоЭмитентам.КодСтрЭм КАК КодСтрЭм,							//  8  Код страны эмитента по ОКСМ
	|	ВТ_ДанныеПоЦБ.КодТипаЦБ КАК КодТипаЦБ,								//  9  Тип ценной бумаги (вид финансового инструмента)
	|	ВТ_ДанныеПоЦБ.НомРегЦБ КАК НомРегЦБ,								// 10  Регистрационный номер выпуска ценной бумаги
	|	ВТ_ДанныеПоЦБ.ISIN КАК ISIN,										// 11  Код ISIN ценной бумаги
	|	ВТ_ДанныеПоЦБ.CFI КАК CFI,											// 12  Код CFI
	|	ВТ_ДанныеПоЦБ.КодВалютыНоминала КАК КодВал,							// 13  Код валюты ценной бумаги
	|	ВТ_ДанныеПоЦБ.НомСтоимЦБ КАК НомСтоимЦБ,							// 14  Номинальная стоимость ценной бумаги в единицах валюты номинала
	|	ВТ_Заблокировано.ВидСчетаДляОтчета КАК ВидСчета,					// 15  Вид счета депо (иного счета), открытого в депозитарии
	|	ВТ_Заблокировано.КолЗЦБ КАК КолЗЦБ,									// 16  Количество заблокированных ценных бумаг
	|	ВТ_Заблокировано.КЗЦБОгрРаспрВсего КАК КЗЦБОгрРаспрВсего, 			// 17  Кол-во заблокированных ЦБ с обременениями - всего
	|	ВТ_Заблокировано.КЗЦБОгрРаспрЗалог КАК КЗЦБОгрРаспрЗалог,			// 18  Кол-во заблокированных ЦБ в залоге
	|	ВТ_Заблокировано.КЗЦБОгрРаспрСчДепо КАК КЗЦБОгрРаспрСчДепо,			// 19  Кол-во заблокированных ЦБ на торговых (клиринговых) счетах депо
	|	ВТ_Заблокировано.КЗЦБОгрРаспрКорпДейств КАК КЗЦБОгрРаспрКорпДейств,	// 20  Кол-во забл. ЦБ распоряжение которыми ограничено в связи с КД
	|	ВТ_Заблокировано.КЗЦБОгрРаспрЗапрОп КАК КЗЦБОгрРаспрЗапрОп,			// 21  Кол-во забл. ЦБ в отношении которых введен запрет на операции
	|	ВТ_Заблокировано.КЗЦБОгрРаспрЭскроу КАК КЗЦБОгрРаспрЭскроу,			// 22  Кол-во забл. ЦБ депонированных по договорам эскроу
	|	ВТ_Заблокировано.КЗЦБОгрРаспрАрест КАК КЗЦБОгрРаспрАрест,			// 23  Кол-во заблокированных ЦБ под арестом
	|	ВТ_Заблокировано.КодСекторЭк КАК КодСекторЭк,						// 24  Владелец счета - код сектора экономики
	|	ВТ_Заблокировано.КодСтрВладельца КАК КодСтрВладельца,				// 25  Владелец счета - код страны
	|	ВТ_Заблокировано.ПризнакВладельцаСчета КАК ПризнакВладельцаСчета,	// 26  Владелец счета - Признак владельца счета: резидент/нерезидент
	|	ДанныеИностранныхОрганизаций.ЮрЛицо КАК ИностраннаяОрганизация,
	|	ДанныеИностранныхОрганизаций.Наименование КАК НаимИнОрг,			// 27  Иностранная организация (вышестоящий депозитарий, регистратор)
	|																		//		- наименование
	|	ДанныеИностранныхОрганизаций.ПризнакНерез КАК ПризнакИнОрг,			// 28  Иностранная организация - Признак: резидент/ нерезидент
	|	ДанныеИностранныхОрганизаций.ПризнакКода КАК ПризнакКодаИнОргНерез,	// 29  Иностранная организация - Признак кода нерезидента
	|	ДанныеИностранныхОрганизаций.РезидентИНН КАК ИНН_ИнОрг,				// 30  Иностранная организация - ИНН резидента
	|	ДанныеИностранныхОрганизаций.КодTIN КАК TIN_ИнОрг,					// 31  Иностранная организация - TIN или LEI или регистрационный 
	|																		//		номер в стране регистрации
	|	ДанныеИностранныхОрганизаций.КодСтраны КАК КодСтрИнОрг,				// 32  Иностранная организация - Код страны по ОКСМ
	|	ДанныеИностранныхОрганизаций.КодСтраны КАК КодСтрКА,				// 33  Код страны (контрагента, платежного агента) блокирующего платежи
	|	ВТ_Заблокировано.СуммаЗВыплат КАК СуммаЗВыплат,						// 34  Сумма выплат по заблокированным ценным бумагам
	|	ЕСТЬNULL(ВалютыВыплат.Код, """") КАК КодВалЗВыплат,					// 35  Код валюты суммы заблокированных выплат 
	|	ВТ_Заблокировано.КолКлиентов КАК КолКлиентов,						// 36  Количество клиентов, на счетах которых учитываются заблокированные ЦБ
	|	ДанныеОрганизаций.ЮрЛицо КАК Организация,
	|	ДанныеОрганизаций.Наименование КАК НаимОрг,							// 37  Вышестоящий депозитарий, регистратор - наименование организации
	|	ДанныеОрганизаций.ПризнакНерез КАК ПризнакОрг,						// 38  Вышестоящий депозитарий, регистратор - Признак организации: рез/нерез
	|	ДанныеОрганизаций.ПризнакКода КАК ПризнакКодаОргНерез,				// 39  Вышестоящий депозитарий, регистратор - Признак кода нерезидента
	|	ДанныеОрганизаций.РезидентИНН КАК ИНН_Орг,							// 40  Вышестоящий депозитарий, регистратор - ИНН организации резидента
	|	ДанныеОрганизаций.КодTIN КАК TIN_Орг,								// 41  Вышестоящий депозитарий, регистратор - TIN или LEI или рег. номер 
	|																		//		в стране рег. нерезидента
	|	ДанныеОрганизаций.ОГРН КАК ОГРН_Орг,								// 42  Вышестоящий депозитарий, регистратор - ОГРН
	|	"""" КАК Примечание													// 43  Примечание
	|ИЗ
	|	ВТ_Заблокировано КАК ВТ_Заблокировано
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоЦБ
	|		ПО ВТ_Заблокировано.ЦБ = ВТ_ДанныеПоЦБ.ЦБ
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЭмитентыЦБ
	|		ПО ВТ_Заблокировано.ЦБ = ВТ_ЭмитентыЦБ.ЦБ
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоЭмитентам
	|		ПО ВТ_ДанныеПоЭмитентам.Эмитент = ВТ_ЭмитентыЦБ.Эмитент
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НаименованияЭмитентовЦБ
	|		ПО ВТ_Заблокировано.ЦБ = ВТ_НаименованияЭмитентовЦБ.ЦБ
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоОрганизациям КАК ДанныеОрганизаций
	|		ПО ВТ_Заблокировано.Организация = ДанныеОрганизаций.ЮрЛицо
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоОрганизациям КАК ДанныеИностранныхОрганизаций
	|		ПО ВТ_Заблокировано.ИностраннаяОрганизация = ДанныеИностранныхОрганизаций.ЮрЛицо
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК ВалютыВыплат
	|		ПО ВТ_Заблокировано.МаксВалютаВыплаты = ВалютыВыплат.Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_НаименованияЭмитентовЦБ.НаименованиеЭм,
	|	ВТ_ДанныеПоЦБ.КодТипаЦБ,
	|	ВТ_ДанныеПоЦБ.НомРегЦБ,
	|	ВТ_Заблокировано.ВидСчетаДляОтчета,
	|	ВТ_Заблокировано.КодСекторЭк,
	|	ВТ_Заблокировано.КодСтрВладельца,
	|	ВТ_Заблокировано.ПризнакВладельцаСчета";
	
	Запрос.УстановитьПараметр("ПериодНачало", ПериодНачало);
	Запрос.УстановитьПараметр("ПериодКонец", КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("ОтчетнаяДата", ОтчетнаяДата());
	Запрос.УстановитьПараметр("ЮрЛицоЕвроклир", РегистрыСведений.ПараметрыГлобальные.ЗначениеПараметра("2217.ЮрЛицоЕвроклир"));
	
	СтрВидыСчетовДепоВключаемыеВОтчет = "NOMINEE,FAUTNOMINEE,OWNER,TRUSTEE,DEPOSIT,TRANSIT,FAUTHOLDER,NONE,SUBOWNER,SUBTRUSTEE"
										+ ",SUBFAUTHOLDER,SUBNOMINEE,SUBFAUTNOMINEE,INVPS,ESCROW,OTHER,WITHDRAWAL,TRANSITOWNER,NONOWNER";
	
	ВидыСчетовДепоВключаемыеВОтчет = СтрРазделить(СтрВидыСчетовДепоВключаемыеВОтчет, ",");
	Запрос.УстановитьПараметр("ВидыСчетовДепоВключаемыеВОтчет", ВидыСчетовДепоВключаемыеВОтчет);
	
	Запрос.УстановитьПараметр("ТипыДепозитарныхРасписок", Перечисления.ТипыЦБ.ВсеТипыДепозитарныхРасписок());
	Запрос.УстановитьПараметр("ТипыЦББезНоминала", Перечисления.ТипыЦБ.ТипыЦББезНоминала());
	
	ВидыСчетовСектораЭк = Новый Массив;
	ВидыСчетовСектораЭк.Добавить("NOMINEE");
	ВидыСчетовСектораЭк.Добавить("FAUTNOMINEE");
	ВидыСчетовСектораЭк.Добавить("OWNER");
	ВидыСчетовСектораЭк.Добавить("TRUSTEE");
	ВидыСчетовСектораЭк.Добавить("FAUTHOLDER");
	ВидыСчетовСектораЭк.Добавить("SUBOWNER");
	ВидыСчетовСектораЭк.Добавить("SUBTRUSTEE");
	ВидыСчетовСектораЭк.Добавить("SUBFAUTHOLDER");
	ВидыСчетовСектораЭк.Добавить("SUBNOMINEE");
	ВидыСчетовСектораЭк.Добавить("SUBFAUTNOMINEE");
	ВидыСчетовСектораЭк.Добавить("ESCROW");
	Запрос.УстановитьПараметр("ВидыСчетовСектораЭк", ВидыСчетовСектораЭк);
	
	РезультатПакета = Запрос.ВыполнитьПакет();
	ИндексПоследнегоЗапроса = РезультатПакета.Количество() - 1;
	ИндексВторогоЗапросаСКонца = ИндексПоследнегоЗапроса - 1;
	ИндексТретьегоЗапросаСКонца = ИндексВторогоЗапросаСКонца - 1;
	ИндексЧетвертогоЗапросаСКонца = ИндексТретьегоЗапросаСКонца - 1;
	ИндексПятогоЗапросаСКонца = ИндексЧетвертогоЗапросаСКонца - 1;
	ИндексШестогоЗапросаСКонца = ИндексПятогоЗапросаСКонца - 1;
	
	ПроверитьДанныеЭмитентов(РезультатПакета[ИндексВторогоЗапросаСКонца].Выгрузить());
	ПроверитьДанныеЦБ(РезультатПакета[ИндексТретьегоЗапросаСКонца].Выгрузить());
	ПроверитьДанныеОрганизаций(РезультатПакета[ИндексЧетвертогоЗапросаСКонца].Выгрузить());
	ПроверитьДанныеМестХранения(РезультатПакета[ИндексПятогоЗапросаСКонца].Выгрузить());
	ПроверитьВалютыВыплат(РезультатПакета[ИндексШестогоЗапросаСКонца].Выгрузить());
	
	ДанныеОтчета.Загрузить(РезультатПакета[ИндексПоследнегоЗапроса].Выгрузить());
КонецПроцедуры
// BSLLS:MethodSize-on

// Процедура выгружает сформированный отчет (данные в табличных частях отчета) в XML-файл
Процедура ВыгрузитьВXML() Экспорт
	ИмяФормы = "0409718";
	ПространствоИмен = "urn:cbr-ru:rep0409718:v1.0.4.5";
	
	СхемаXSD = ПолучитьМакет("Ф718_Schema_XSD");
	Фабрика = РегуляторнаяОтчетность.ФабрикаИзСхемыXSD(СхемаXSD);
	Отчетность = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409718"));
	
	ОтчетнаяДата = ОтчетнаяДата();
	
	УникИдОЭС = Новый УникальныйИдентификатор;
	Отчетность.УникИдОЭС = Строка(УникИдОЭС);	// Пример: "8b91f09d-da8b-11ed-811d-00155d1a3509";
	Отчетность.ВидОЭС = "Отчетность КО";
	Отчетность.КодФормы = ИмяФормы;
	Отчетность.ОКУД = ИмяФормы;
	Отчетность.ВидОтчета = "КО";
	Отчетность.ОтчДата = ОтчетнаяДата;	// BSLLS:Typo-off
	Отчетность.Периодичность = "месячная";
	Отчетность.ДатаВремяФормирования = ТекущаяДатаСеанса();
	
	Отчетность.Составитель = СоставительОтчета(Фабрика, ПространствоИмен, ОтчетнаяДата);
	
	Отчетность.Данные718 = Данные718(Фабрика, ПространствоИмен);
	
	РегуляторнаяОтчетность.ЗаписатьОтчетностьДляДельтыВXML(Фабрика, Отчетность, ИмяФормы, ПериодНачало, ПериодКонец);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Процедура осуществляет проверку данных эмитентов, упомянутых в отчете на соответествие схеме XSD.
// Например, проверяется ожидаемая длинна и состав символов ИНН и ОГРН ...
// Параметры:
//	ДанныеЭмитентов - ТаблицаЗначений
Процедура ПроверитьДанныеЭмитентов(ДанныеЭмитентов)
	ДлиныИНН = РегуляторнаяОтчетность.ДопустимыеДлиныИНН();
	ДлиныОГРН = РегуляторнаяОтчетность.ДопустимыеДлиныОГРН();
	
	Для каждого Данные Из ДанныеЭмитентов Цикл
		
		Если НЕ ЗначениеЗаполнено(Данные.ЮридическиеФизическиеЛица) Тогда
			ОписаниеОшибки = "Для эмитента " + Строка(Данные.Эмитент) + " не указано юридическое/физическое лицо";
			РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
		Принадлежность = "эмитента";
		РегуляторнаяОтчетность.ПроверитьЦифровуюСтроку(ОписаниеОшибок, "ИНН", Принадлежность, Данные.ИНН_Эм, Данные.Эмитент, ДлиныИНН);
		РегуляторнаяОтчетность.ПроверитьЦифровуюСтроку(ОписаниеОшибок, "ОГРН", Принадлежность, Данные.ОГРН_Эм, Данные.Эмитент, ДлиныОГРН);
		РегуляторнаяОтчетность.ПроверитьЦифровуюСтроку(ОписаниеОшибок, "Код страны", Принадлежность, Данные.КодСтрЭм, Данные.Эмитент, 3);
		Если Данные.ПризнакКодаЭмНерез = "LEI" И Данные.КоличествоLEI > 1 Тогда
			ОписаниеОшибки = "Для эмитента " + Строка(Данные.Эмитент) + " в справочнике кодов загрузки имеется более одного действующего кода LEI";
			РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
		Если Данные.НетСоответствияИННДляЦБРФ Тогда
			ОписаниеОшибки = "Для ЮЛ [" + Строка(Данные.Эмитент) + "] не найдено соответствие в справочнике ИНН и ОРГН ЦБ РФ";
			РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
		Если Данные.ИНН_Эм = "0000000000" Тогда
			ОписаниеОшибки = "У эмитента " + Строка(Данные.Эмитент) + " отсутствует ИНН";
			РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
		Если Данные.ЭтоРезидентИлиНерезидентМК И Данные.ОГРН_Эм = "" Тогда
			ОписаниеОшибки = "У эмитента " + Строка(Данные.Эмитент) + " отсутствует ОГРН";
			РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьДанныеЦБ(ДанныеЦБ)
	Для каждого Данные Из ДанныеЦБ Цикл
		Если Не Данные.ЦББезНоминала Тогда
			Если Не ЗначениеЗаполнено(Данные.НомСтоимЦБ) Тогда
				ОписаниеОшибки = РегуляторнаяОтчетность.ОписаниеОшибкиЦБ(Данные.ЦБ, "не указан номинал", Данные.ISIN);
				РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Данные.ВалютаНоминала) Тогда
				ОписаниеОшибки = РегуляторнаяОтчетность.ОписаниеОшибкиЦБ(Данные.ЦБ, "не указана валюта номинала", Данные.ISIN);
				РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьДанныеМестХранения(ДанныеМХ)
	Для каждого Данные Из ДанныеМХ Цикл
		Если Не ЗначениеЗаполнено(Данные.ЮрЛицо) Тогда
			ОписаниеОшибки = "В карточке места хранения " + Строка(Данные.МестоХранения.Наименование) + " не указано юридическое лицо";
			РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьДанныеОрганизаций(ДанныеОрганизаций)
	Для каждого Данные Из ДанныеОрганизаций Цикл
		Если Данные.РезидентИНН = "0000000000" И ЗначениеЗаполнено(Данные.ЮрЛицо) Тогда
			ОписаниеОшибки = "У организации-резидента " + Строка(Данные.Наименование) + " отсутствует ИНН";
			РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьВалютыВыплат(ДанныеПоВалютамВыплат)
	Для каждого Данные Из ДанныеПоВалютамВыплат Цикл
		ОписаниеОшибки = "Обнаружены заблокированные выплаты в нескольких разных валютах по ЦБ " + Строка(Данные.ЦБ)
							+ " в организации " + Строка(Данные.Организация) + " как минимум в " + Строка(Данные.МинВалютаВыплаты)
							+ " и " + Строка(Данные.МаксВалютаВыплаты);
			РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
	КонецЦикла;
КонецПроцедуры
	

Функция СоставительОтчета(Фабрика, ПространствоИмен, ОтчетнаяДата)
	Составитель = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409718Составитель"));
	
	Составитель.Руководитель = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409718СоставительРуководитель"));
	РегуляторнаяОтчетность.ЗаполнитьИнформациюОбОтветственномЛице(Составитель.Руководитель, Организация,
								Перечисления.ОтветственныеЛицаОрганизаций.ПодписантВРегуляторнойОтчетности, ОтчетнаяДата);
	Составитель.Исполнитель = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409718СоставительИсполнитель"));
	РегуляторнаяОтчетность.ЗаполнитьИнформациюОбОтветственномЛице(Составитель.Исполнитель, Организация,
								Перечисления.ОтветственныеЛицаОрганизаций.ИсполнительВРегуляторнойОтчетности, ОтчетнаяДата);
	
	РегуляторнаяОтчетность.ЗаполнитьИнформациюОбОрганизации(Составитель, Организация, ОтчетнаяДата);
	
	Возврат Составитель;
КонецФункции

Функция Данные718(Фабрика, ПространствоИмен)
	Данные718 = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409718Данные718"));
	Данные718.Ид = "1";
	Данные718.ДанныеОтчета = Данные718ДанныеОтчета(Фабрика, ПространствоИмен);
	
	Возврат Данные718;
КонецФункции

Функция Данные718ДанныеОтчета(Фабрика, ПространствоИмен)
	Данные = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409718Данные718ДанныеОтчета"));
	
	СписокРеквизитов = "ПризнакЭм,НаименованиеЭм,ПризнакКодаЭмНерез,ИНН_Эм,TIN_Эм,ОГРН_Эм,КодСтрЭм,КодТипаЦБ"		// BSLLS:Typo-off
					+ ",НомРегЦБ,ISIN,CFI,КодВал,ВидСчета,КодСекторЭк,КодСтрВладельца,ПризнакВладельцаСчета"		// BSLLS:Typo-off
					+ ",ПризнакИнОрг,НаимИнОрг,ПризнакКодаИнОргНерез,ИНН_ИнОрг,TIN_ИнОрг,КодСтрИнОрг,КодСтрКА"		// BSLLS:Typo-off
					+ ",КодВалЗВыплат,КолКлиентов,ПризнакОрг,НаимОрг,ПризнакКодаОргНерез,ИНН_Орг,TIN_Орг"			// BSLLS:Typo-off
					+ ",ОГРН_Орг,Примечание";																		// BSLLS:Typo-off
	ОбычныеРеквизиты = СтрРазделить(СписокРеквизитов, ",");
	
	СписокРеквизитов = "НомСтоимЦБ,КолЗЦБ,КЗЦБОгрРаспрВсего,КЗЦБОгрРаспрЗалог,КЗЦБОгрРаспрСчДепо"					// BSLLS:Typo-off
					+ ",КЗЦБОгрРаспрКорпДейств,КЗЦБОгрРаспрЗапрОп,КЗЦБОгрРаспрЭскроу,КЗЦБОгрРаспрАрест";			// BSLLS:Typo-off
	РеквизитыСЧислами20Знаков = СтрРазделить(СписокРеквизитов, ",");
	
	Для каждого СтрокаТЧ Из ДанныеОтчета Цикл
		СтруктураXDTO = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409718Данные718ДанныеОтчетаЗаблокЦБ"));	// BSLLS:Typo-off
		СтруктураXDTO.НомСтр = СтрокаТЧ.НомерСтроки;
		ЗаполнитьРеквизитыНепустымиЗначениями(СтруктураXDTO, СтрокаТЧ, ОбычныеРеквизиты);
		// Осторожно! Схема хранимая в конфигурации модифицирована по сравнению с оригинальной:
		// Добалены два новых типа "Строка38-лок" и "Строка32-лок", тип атрибутов 
		// Десят30.20Неотриц-лок заменен на Строка38-лок, а Десят30.2Неотриц-лок - "Строка32-лок"
		// Это потребовалось, чтобы все числа можно было выгрузить в файл дополненными до 20 (или 2) нулей после запятой
		ЗаполнитьРеквизитыВФормате20ЗнаковПослеЗапятой(СтруктураXDTO, СтрокаТЧ, РеквизитыСЧислами20Знаков);
		Если ЗначениеЗаполнено(СтрокаТЧ.СуммаЗВыплат) Тогда
			СтруктураXDTO.СуммаЗВыплат = Формат(СтрокаТЧ.СуммаЗВыплат, "ЧЦ=32; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=");
		КонецЕсли;
		Данные.ЗаблокЦБ.Добавить(СтруктураXDTO);
	КонецЦикла;
		
	Возврат Данные;
КонецФункции

Процедура ЗаполнитьРеквизитыНепустымиЗначениями(СтруктураXDTO, СтрокаТЧ, Реквизиты)
	Для Каждого ИмяРеквизита Из Реквизиты Цикл
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтруктураXDTO[ИмяРеквизита], СтрокаТЧ[ИмяРеквизита]);
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьРеквизитыВФормате20ЗнаковПослеЗапятой(СтруктураXDTO, СтрокаТЧ, РеквизитыСЧислами20Знаков)
	ФорматЧисла = "ЧЦ=38; ЧДЦ=20; ЧРД=.; ЧН=; ЧГ=";
	Для Каждого ИмяРеквизита Из РеквизитыСЧислами20Знаков Цикл
		Если ИмяРеквизита <> "НомСтоимЦБ" Или ЗначениеЗаполнено(СтрокаТЧ.НомСтоимЦБ) Тогда
			СтруктураXDTO[ИмяРеквизита] = Формат(СтрокаТЧ[ИмяРеквизита], ФорматЧисла);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ОтчетнаяДата()
	Возврат КонецДня(ПериодКонец) + 1; // следующий день после даты конца выбранного отчетного периода
КонецФункции

#КонецОбласти


#Область Инициализация

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);

#КонецОбласти
